In [3]:
import pandas as pd
food=pd.read_csv("foods.csv")
food.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [4]:
food.pivot_table(index='Gender', values='Spend',aggfunc="sum")

           Spend
Gender
Female  25963.33
Male    24106.04